app/controllers/top_players_controller.rb

  def index
    @players = TopPlayer.order(total_win: :desc).limit(11)
---
SELECT  "top_players".* FROM "top_players"  ORDER BY "top_players"."total_win" DESC LIMIT 11